Revit 2024 API
SchemaCommon.VersionGUID Property
 The property labeled "VersionGUID" common to all visual Asset types.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string VersionGUID { get; }
Visual Basic
Public Shared ReadOnly Property VersionGUID As String
	Get
Visual C++
public:
static property String^ VersionGUID {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyString" and will contain a uuid.
See Also
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace